# --------------------------------------------------------------------------------
# Модуль обработки команд из приватных чатов
# --------------------------------------------------------------------------------
# Импорты
# --------------------------------------------------------------------------------

from dataclasses import dataclass
from io import BytesIO
import mimetypes
import os

from aiogram import types, Router
from aiogram.filters import Command, CommandStart
from aiogram.fsm.context import FSMContext
from aiogram.fsm.state import State, StatesGroup



# --------------------------------------------------------------------------------
# Дата классы
# --------------------------------------------------------------------------------


@dataclass
class Bank_customer:
    """Банковские реквизиты заказчика"""
    name: str  # наименование банка
    BIC: str  # БИК
    current_account: str  # расчётный счёт
    corporate_account: str  # корреспондентский счёт


@dataclass
class Bank_executor:
    """Банковские реквизиты исполнителя"""
    name: str  # наименование банка
    BIC: str  # БИК
    current_account: str  # расчётный счёт
    corporate_account: str  # корреспондентский счёт


@dataclass
class Executor:
    """Исполнитель"""
    name: str  # полное название юридического лица, наприемер, ООО «Рога и копыта»
    INN: str  # ИНН
    OGRN: str  # ОГРН или ОГРНИП
    address: str  # юридический адрес
    signatory: str  # подписант
    bank: Bank_customer  # банковские реквизиты заказчика

@dataclass
class Customer:
    """Заказчик"""
    name: str  # полное название юридического лица, наприемер, ООО «Рога и копыта»
    INN: str  # ИНН
    OGRN: str  # ОГРН или ОГРНИП
    address: str  # юридический адрес
    signatory: str  # подписант
    bank: Bank_executor  # банковские реквизиты заказчика


@dataclass
class Job:
    task: str  # выполненная задача
    price: int  # цена за задачу


# --------------------------------------------------------------------------------
# Инструменты агента
# --------------------------------------------------------------------------------


# --------------------------------------------------------------------------------
# Агент
# --------------------------------------------------------------------------------




# --------------------------------------------------------------------------------
# Настройки
# --------------------------------------------------------------------------------


user_private_router = Router()

TYPST_BIN = os.path.join("typst", "typst.exe")

SYSTEM_PROMPT = (
        "Твоя задача спросить у пользователя, что он хочет сгенерировать — акт или счёт или оба документа. "
        "Затем нужно сгенерировать акт или счёт, для этого тебе надо взять реквизиты "
        "контрагента из памяти. Обязательно Запроси работы для включения в "
        "акт (наименования задач и их стоимость), работ может быть несколько. "
        "Если пользователь указывает в качетсве работы курс, то для документов берём одну работу, в точности такую "
        "\"Обучение одного сотрудника на курсе «Хардкорная веб-разработка»\", стоимостью 170 тыс руб."
        "Никакие данные не придумывай, всё необходимое строго запроси у "
        "пользователя. Реквизиты уже есть в памяти и переданы тебе."
        "Имя и отчество подписанта сокращаем до одной первой буквы, "
        "например, Иванов А.Е. "
        "Название компании оборачиваем в кавычки ёлочкой, например, "
        "ООО «Рога и копыта», то есть до названия компании ставим « и после названия "
        "ставим »."
    )


# --------------------------------------------------------------------------------
# Инициализация агента
# --------------------------------------------------------------------------------





# --------------------------------------------------------------------------------
# Обработчики
# --------------------------------------------------------------------------------


@user_private_router.message(CommandStart())
async def start_cmd(message: types.Message, state: FSMContext):
    await message.answer("Приветсвую! Я бот для генерации актов и счетов. Отправь мне файл с реквизитами исполнителя")
    await state.set_state(ReqFiles.waiting_my_file)


@user_private_router.message(Command("new"))
async def new_document(message: types.Message, state: FSMContext):
    await state.clear()
    await message.answer("Забыл все предыдущие действия, отправьте мне реквизиты исполнителя")
    await state.set_state(ReqFiles.waiting_my_file)


# --------------------------------------------------------------------------------
# FSM для получения файлов с реквизитами
# --------------------------------------------------------------------------------


class ReqFiles(StatesGroup):
    waiting_my_file = State()
    waiting_client_file = State()
    chatting = State()


@user_private_router.message(F.document)
async def handle_file(message: types.Message, state: FSMContext, bot):
    current_state = await state.get_state()

    doc = message.document
    file_id = doc.file_id
    file_name = doc.file_name

    mime_type, _ = mimetypes.guess_type(file_name)
    if not mime_type:
        mime_type = "application/octet-stream"


    # Временное имя файла
    if current_state == ReqFiles.waiting_my_file.state:
        next_state = ReqFiles.waiting_client_file
        prompt = "Файл реквизитов исполнителя получен! 🎉 \nТеперь отправьте файл с реквизитами заказчика."

    elif current_state == ReqFiles.waiting_client_file.state:
        next_state = ReqFiles.chatting
        prompt = "Файл реквизитов заказчика получен! 🎉"

    else:
        await message.answer("Сначала отправьте файл с ревизитами")
        return

    # ---- Скачиваем файл в память ----
    buffer = BytesIO()
    buffer.name = file_name

    file = await bot.get_file(file_id)
    await bot.download_file(file.file_path, buffer)
    buffer.seek(0)



    # ---- Если это первый файл, то ждём второй ----
    if next_state != ReqFiles.chatting:
        await message.answer(prompt)
        await state.set_state(next_state)
        return
    elif next_state == ReqFiles.chatting:
        await message.answer(prompt)

        # ---- Переходим в режим диалога ----
        await state.set_state(ReqFiles.chatting)


@user_private_router.message(ReqFiles.chatting)
async def agent_chat(message: types.Message, state: FSMContext):
    pass