# --------------------------------------------------------------------------------
# Модуль обработки команд из приватных чатов
# --------------------------------------------------------------------------------
# Импорты
# --------------------------------------------------------------------------------

from aiogram import types, Router
from aiogram.filters import CommandStart



# --------------------------------------------------------------------------------
# Настройки
# --------------------------------------------------------------------------------


user_private_router = Router()


# --------------------------------------------------------------------------------
# Обработчики
# --------------------------------------------------------------------------------


@user_private_router.message(CommandStart())
async def start_cmd(message: types.Message):
    await message.answer("Приветсвую! Я бот для генерации актов и счетов. Отправь мне файл с вашими реквизитам")