# --------------------------------------------------------------------------------
# Список реквизитов
# --------------------------------------------------------------------------------


Requisites = [
    "Полное наименование организации",
    "Сокращённое наименование организации",
    "ОГРН",
    "ИНН",
    "КПП",
    "Адрес местонахождения",
    "Почтовый адрес",
    "Телефон",
    "ОКПО",
    "ОКВЭД",
    "ОКТМО",
    "Расчетный счёт",
    "Наименование банка",
    "Корреспондентский счёт",
    "БИК",
    "Подписант",
]


